// main.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"

//Написать программу «Автоматизированная информационная система ЖД вокзала».
//Система содержит : сведения об отправлении поездов дальнего следования.
//Для каждого поезда указываем : номер, время отправления, станцию назначения.
//Обеспечить :
//	Ввод данных в систему
//	Вывод информации о всех поездах
//	Вывод информации о запрашиваемом поезде
//	Использовать контейнерный класс deque или vector

int main()
{
	TimeTable MyTable;
	MyTable();
	return 0;
}